2zzyyyq/3C/n32g033_std_periph_driver/inc/n32g033_i2c.h
/* I2C Interrupt Enable mask */
#define I2C_INTEN_MASK ((uint32_t)0x70000000)

/* I2C reserved mask */
#define I2C_STS1_RESERVED_MASK ((uint32_t)0x03807F7F)


/**  I2C_BusMode **/
#define I2C_BUSMODE_I2C        (I2C_CTRL_BIT_MASK)
#define I2C_BUSMODE_SMBDEVICE  (I2C_CTRL1_SMBMODE)
#define I2C_BUSMODE_SMBHOST    (I2C_CTRL1_SMBMODE | I2C_CTRL1_SMBTYPE)


/**  I2C_duty_cycle **/
#define I2C_SMDUTYCYCLE_1       (I2C_REG_BIT_MASK)  /* I2C standard mode Tlow/Thigh = 1/1 */
#define I2C_FMDUTYCYCLE_16_9    (I2C_CLKCTRL_DUTY)  /* I2C fast mode Tlow/Thigh = 16/9 */
#define I2C_FMDUTYCYCLE_2       ((uint16_t)~I2C_CLKCTRL_DUTY) /* I2C fast mode Tlow/Thigh = 2 */


/**  I2C_acknowledgement **/
#define I2C_ACKEN               (I2C_CTRL1_ACKEN)
#define I2C_ACKDIS              (I2C_CTRL_BIT_MASK)


/**  I2C_transfer_direction **/
#define I2C_DIRECTION_SEND          ((uint8_t)0x00)
#define I2C_DIRECTION_RECV          ((uint8_t)0x01)


/**  I2C_acknowledged_address **/
/* Bit 14 Should be kept at 1 by software*/
#define I2C_ADDR_MODE_7BIT    (((uint16_t)0x4000) | I2C_REG_BIT_MASK) 
#define I2C_ADDR_MODE_10BIT   (((uint16_t)0x4000) | I2C_OADDR1_ADDRMODE) 

/**  I2C_SMBus_alert_pin_level **/
#define I2C_SMBALERT_LOW        (I2C_CTRL1_SMBALERT)
#define I2C_SMBALERT_HIGH       (~I2C_CTRL1_SMBALERT)

/**  I2C_NCAK_or_PEC_position **/
#define I2C_NACK_POS_NEXT         (I2C_CTRL1_ACKPOS)
#define I2C_NACK_POS_CURRENT      (~I2C_CTRL1_ACKPOS)

#define I2C_PEC_POS_NEXT         (I2C_CTRL1_ACKPOS)
#define I2C_PEC_POS_CURRENT      (~I2C_CTRL1_ACKPOS)

/**  I2C_Analog_Filter_Width **/
#define I2C_ANALOG_FILTER_WIDTH_5NS   (I2C_REG_BIT_MASK)
#define I2C_ANALOG_FILTER_WIDTH_15NS  (I2C_GFLTRCTRL_SDAAFW_0)
#define I2C_ANALOG_FILTER_WIDTH_25NS  (I2C_GFLTRCTRL_SDAAFW_1)
#define I2C_ANALOG_FILTER_WIDTH_35NS  (I2C_GFLTRCTRL_SDAAFW_0|I2C_GFLTRCTRL_SDAAFW_1)

/**  I2C_interrupts_definition **/
#define I2C_INT_BUF        (I2C_CTRL2_BUFINTEN)
#define I2C_INT_EVENT      (I2C_CTRL2_EVTINTEN)
#define I2C_INT_ERR        (I2C_CTRL2_ERRINTEN)

/* I2C BYTE_NUM_EN mask */
#define I2C_BYTENUMEN_SET        (I2C_BYTENUM_BYTENUMEN)
#define I2C_BYTENUMEN_RESET      (~I2C_BYTENUM_BYTENUMEN)

/* I2C BYTE_NUM byte number mask */
#define I2C_BYTENUM_MASK         (~I2C_BYTENUM_BYTENUM)

/* I2C master sended status after finishing receiving data bytes */
#define I2C_BYTENUM_LAST_STOP    (~I2C_BYTENUM_RXFSEL)
#define I2C_BYTENUM_LAST_START   (I2C_BYTENUM_RXFSEL)

/* I2C timeout detection function enable */
#define I2C_LTOSEL_MASK              (~I2C_CTRL1_LTOSEL)
#define I2C_TIMEOUT_LOWLIMIT_25MS    (I2C_CTRL_BIT_MASK)
#define I2C_TIMEOUT_LOWLIMIT_100MS   (I2C_CTRL1_LTOSEL_0)
#define I2C_TIMEOUT_LOWLIMIT_1S      (I2C_CTRL1_LTOSEL_1)
#define I2C_TIMEOUT_LOWLIMIT_4S      (I2C_CTRL1_LTOSEL_0|I2C_CTRL1_LTOSEL_1)

#define I2C_HTOSEL_MASK               (~I2C_CTRL1_HTOSEL)
#define I2C_TIMEOUT_HIGHLIMIT_256US   (I2C_CTRL_BIT_MASK)
#define I2C_TIMEOUT_HIGHLIMIT_512US   (I2C_CTRL1_HTOSEL_0)
#define I2C_TIMEOUT_HIGHLIMIT_1MS     (I2C_CTRL1_HTOSEL_1)
#define I2C_TIMEOUT_HIGHLIMIT_128US   (I2C_CTRL1_HTOSEL_0|I2C_CTRL1_HTOSEL_1)

#define I2C_TIMEOUT_INT_SCLLOW    (I2C_CTRL2_SCLLTOINTEN)
#define I2C_TIMEOUT_INT_SCLHIGH   (I2C_CTRL2_SCLHTOINTEN)
#define I2C_TIMEOUT_INT_SDALOW    (I2C_CTRL2_SDALTOINTEN)

#define I2C_TIMEOUT_LOW           (I2C_CTRL2_LTOEN)
#define I2C_TIMEOUT_HIGH          (I2C_CTRL2_HTOEN)

#define I2C_TIMEOUT_FLAG_SCLLOW    (I2C_STS1_SCLLTO)
#define I2C_TIMEOUT_FLAG_SCLHIGH   (I2C_STS1_SCLHTO)
#define I2C_TIMEOUT_FLAG_SDALOW    (I2C_STS1_SDALTO)

/**  I2C_interrupts_definition **/
#define I2C_INT_SMBALERT (((uint32_t)0x40000000) | ((uint32_t)I2C_STS1_SMBALERT))
#define I2C_INT_TIMEOUT  (((uint32_t)0x40000000) | ((uint32_t)I2C_STS1_TIMEOUT))
#define I2C_INT_PECERR   (((uint32_t)0x40000000) | ((uint32_t)I2C_STS1_PECERR))
#define I2C_INT_OVERRUN  (((uint32_t)0x40000000) | ((uint32_t)I2C_STS1_OVERRUN))
#define I2C_INT_ACKFAIL  (((uint32_t)0x40000000) | ((uint32_t)I2C_STS1_ACKFAIL))
#define I2C_INT_ARLOST   (((uint32_t)0x40000000) | ((uint32_t)I2C_STS1_ARLOST))
#define I2C_INT_BUSERR   (((uint32_t)0x40000000) | ((uint32_t)I2C_STS1_BUSERR))
#define I2C_INT_TXDATE   (((uint32_t)0x30000000) | ((uint32_t)I2C_STS1_TXDATE))
#define I2C_INT_RXDATNE  (((uint32_t)0x30000000) | ((uint32_t)I2C_STS1_RXDATNE))
#define I2C_INT_STOPF    (((uint32_t)0x20000000) | ((uint32_t)I2C_STS1_STOPF))
#define I2C_INT_ADDR10F  (((uint32_t)0x20000000) | ((uint32_t)I2C_STS1_ADDR10F))
#define I2C_INT_BYTEF    (((uint32_t)0x20000000) | ((uint32_t)I2C_STS1_BSF))
#define I2C_INT_ADDRF    (((uint32_t)0x20000000) | ((uint32_t)I2C_STS1_ADDRF))
#define I2C_INT_STARTBF  (((uint32_t)0x20000000) | ((uint32_t)I2C_STS1_STARTBF))

/**  I2C_flags_definition **/

/** STS2 register flags **/
#define I2C_FLAG_DUALFLAG  (((uint32_t)I2C_STS2_DUALFLAG)<<REG_BIT16_OFFSET)
#define I2C_FLAG_SMBHADDR  (((uint32_t)I2C_STS2_SMBHADDR)<<REG_BIT16_OFFSET)
#define I2C_FLAG_SMBDADDR  (((uint32_t)I2C_STS2_SMBDADDR)<<REG_BIT16_OFFSET)
#define I2C_FLAG_GCALLADDR (((uint32_t)I2C_STS2_GCALLADDR)<<REG_BIT16_OFFSET)
#define I2C_FLAG_TRF       (((uint32_t)I2C_STS2_TRF)<<REG_BIT16_OFFSET)
#define I2C_FLAG_BUSY      (((uint32_t)I2C_STS2_BUSY)<<REG_BIT16_OFFSET)
#define I2C_FLAG_MSMODE    (((uint32_t)I2C_STS2_MSMODE)<<REG_BIT16_OFFSET)

/** STS1 register flags **/
#define I2C_FLAG_SMBALERT (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_SMBALERT))
#define I2C_FLAG_TIMEOUT  (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_TIMEOUT))
#define I2C_FLAG_PECERR   (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_PECERR))
#define I2C_FLAG_OVERRUN  (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_OVERRUN))
#define I2C_FLAG_ACKFAIL  (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_ACKFAIL))
#define I2C_FLAG_ARLOST   (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_ARLOST))
#define I2C_FLAG_BUSERR   (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_BUSERR))
#define I2C_FLAG_TXDATE   (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_TXDATE))
#define I2C_FLAG_RXDATNE  (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_RXDATNE))
#define I2C_FLAG_STOPF    (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_STOPF))
#define I2C_FLAG_ADDR10F  (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_ADDR10F))
#define I2C_FLAG_BYTEF    (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_BSF))
#define I2C_FLAG_ADDRF    (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_ADDRF))
#define I2C_FLAG_STARTBF  (((uint32_t)0x10000000) | ((uint32_t)I2C_STS1_STARTBF))


/***  I2C_Events ***/

/** I2C Master Events (Events grouped in order of communication) **/
/**
*\*\brief  Communication start
*\*\       After sending the START condition (I2C_Generate_Start_Enable() function) the master
*\*\       has to wait for this event. It means that the Start condition has been correctly
*\*\       released on the I2C bus (the bus is free, no other devices is communicating).
**/

/* MSMODE */ 
#define I2C_ROLE_MASTER (((uint32_t)I2C_STS2_MSMODE)<<16) 
/* EV5 */
/* BUSY, MSMODE and STARTBF flag*/
#define I2C_EVT_MASTER_MODE_FLAG (((uint32_t)I2C_STS1_STARTBF)\
                                |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_MSMODE))<<16))
 

/**
*\*\brief  Address Acknowledge
*\*\       After checking on EV5 (start condition correctly released on the bus), the
*\*\       master sends the address of the slave(s) with which it will communicate
*\*\      (I2C_7bit_Address_Send() function, it also determines the direction of the communication:
*\*\      Master transmitter or Receiver). Then the master has to wait that a slave acknowledges
*\*\      his address. If an acknowledge is sent on the bus, one of the following events will
*\*\      be set:
*\*\       1) In case of Master Receiver (7-bit addressing): the I2C_EVT_MASTER_RXMODE_FLAG
*\*\          event is set.
*\*\       2) In case of Master Transmitter (7-bit addressing): the I2C_EVT_MASTER_TXMODE_FLAG
*\*\          is set
*\*\       3) In case of 10-Bit addressing mode, the master (just after generating the START
*\*\       and checking on EV5) has to send the header of 10-bit addressing mode (I2C_Data_Send()
*\*\       function). Then master should wait on EV9. It means that the 10-bit addressing
*\*\       header has been correctly sent on the bus. Then master should send the second part of
*\*\       the 10-bit address (LSB) using the function I2C_7bit_Address_Send(). Then master
*\*\       should wait for event EV6.
 **/

