2zzyyyq/3C/n32g033_std_periph_driver/inc/n32g033_i2c.h
/* --EV6 */
/* BUSY, MSMODE, ADDRF, TXDATE and TRF flags */
#define I2C_EVT_MASTER_TXMODE_FLAG (((uint32_t)I2C_STS1_ADDRF)|((uint32_t)I2C_STS1_TXDATE)\
                                  |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_MSMODE)|((uint32_t)I2C_STS2_TRF))<<16)) 
/* BUSY, MSMODE and ADDRF flags */
#define I2C_EVT_MASTER_RXMODE_FLAG (((uint32_t)I2C_STS1_ADDRF)\
                                  |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_MSMODE))<<16)) 
/* --EV9 */
/* BUSY, MSMODE and ADD10RF flags */
#define I2C_EVT_MASTER_MODE_ADDRESS10_FLAG (((uint32_t)I2C_STS1_ADDR10F)\
                                          |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_MSMODE))<<16))  

/**
*\*\brief Communication events
*\*\      If a communication is established (START condition generated and slave address
*\*\      acknowledged) then the master has to check on one of the following events for
*\*\      communication procedures:
*\*\      1) Master Receiver mode: The master has to wait on the event EV7 then to read
*\*\         the data received from the slave (I2C_Data_Recv() function).
*\*\      2) Master Transmitter mode: The master has to send data (I2C_Data_Send()
*\*\         function) then to wait on event EV8 or EV8_2.
*\*\         These two events are similar:
*\*\          - EV8 means that the data has been written in the data register and is
*\*\            being shifted out.
*\*\          - EV8_2 means that the data has been physically shifted out and output
*\*\            on the bus.
*\*\          In most cases, using EV8 is sufficient for the application.
*\*\          Using EV8_2 leads to a slower communication but ensure more reliable test.
*\*\          EV8_2 is also more suitable than EV8 for testing on the last data transmission
*\*\          (before Stop condition generation).
*\*\note In case the  user software does not guarantee that this event EV7 is
*\*\     managed before the current byte end of transfer, then user may check on EV7
*\*\     and BSF flag at the same time (ie. (I2C_EVT_MASTER_DATA_RECVD_FLAG | I2C_FLAG_BYTEF)).
*\*\     In this case the communication may be slower.
 **/

/* Master RECEIVER mode -----------------------------*/
/* --EV7 */
/* BUSY, MSMODE and RXDATNE flags */
#define I2C_EVT_MASTER_DATA_RECVD_FLAG (((uint32_t)I2C_STS1_RXDATNE)\
                                       |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_MSMODE))<<16)) 
                                       
/* EV7x shifter register full */
/* BUSY, MSMODE, BSF and RXDATNE flags */
#define I2C_EVT_MASTER_DATA_RECVD_BSF_FLAG (((uint32_t)I2C_STS1_RXDATNE)|((uint32_t)I2C_STS1_BSF)\
                                          |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_MSMODE))<<16))

/* Master TRANSMITTER mode --------------------------*/
/* --EV8 */
/* TRF, BUSY, MSMODE, TXDATE flags */
#define I2C_EVT_MASTER_DATA_SENDING (((uint32_t)I2C_STS1_TXDATE)\
                  |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_MSMODE)|((uint32_t)I2C_STS2_TRF))<<16)) 
/* --EV8_2 */
/* TRF, BUSY, MSMODE, TXDATE and BSF flags */
#define I2C_EVT_MASTER_DATA_SENDED (((uint32_t)I2C_STS1_BSF)|((uint32_t)I2C_STS1_TXDATE)\
                  |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_MSMODE)|((uint32_t)I2C_STS2_TRF))<<16)) 

/***  I2C Slave Events (Events grouped in order of communication) ***/

/**
*\*\brief  Communication start events
*\*\       Wait on one of these events at the start of the communication. It means that
*\*\       the I2C peripheral detected a Start condition on the bus (generated by master
*\*\       device) followed by the peripheral address. The peripheral generates an ACK
*\*\       condition on the bus (if the acknowledge feature is enabled through function
*\*\       I2C_ConfigAck()) and the events listed above are set :
*\*\       1) In normal case (only one address managed by the slave), when the address
*\*\         sent by the master matches the own address of the peripheral (configured by
*\*\         OwnAddr1 field) the I2C_EVENT_SLAVE_XXX_ADDRESS_MATCHED event is set
*\*\         (where XXX could be TRANSMITTER or RECEIVER).
*\*\       2) In case the address sent by the master matches the second address of the
*\*\         peripheral (configured by the function I2C_ConfigOwnAddr2() and enabled
*\*\         by the function I2C_EnableDualAddr()) the events I2C_EVENT_SLAVE_XXX_SECONDADDRESS_MATCHED
*\*\         (where XXX could be TRANSMITTER or RECEIVER) are set.
*\*\       3) In case the address sent by the master is General Call (address 0x00) and
*\*\         if the General Call is enabled for the peripheral (using function I2C_EnableGeneralCall())
*\*\         the following event is set I2C_EVT_SLAVE_GCALLADDR_MATCHED.
 **/

/* --EV1  (all the events below are variants of EV1) */
/* 1) Case of One Single Address managed by the slave */
 /* BUSY and ADDRF flags */
#define I2C_EVT_SLAVE_RECV_ADDR_MATCHED (((uint32_t)I2C_STS1_ADDRF)\
                                       |((((uint32_t)I2C_STS2_BUSY))<<16)) 
 /* TRF, BUSY, TXDATE and ADDRF flags */
#define I2C_EVT_SLAVE_SEND_ADDR_MATCHED (((uint32_t)I2C_STS1_TXDATE)|((uint32_t)I2C_STS1_ADDRF)\
                                       |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_TRF))<<16))

/* 2) Case of Dual address managed by the slave */
 /* DUALF and BUSY flags */
#define I2C_EVT_SLAVE_RECV_ADDR2_MATCHED ((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_DUALFLAG))<<16) 
 /* DUALF, TRF, BUSY and TXDATE flags */
#define I2C_EVT_SLAVE_SEND_ADDR2_MATCHED (((uint32_t)I2C_STS1_TXDATE)\
               |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_DUALFLAG)|((uint32_t)I2C_STS2_TRF))<<16))

/* 3) Case of General Call enabled for the slave */
 /* GENCALL and BUSY flags */
#define I2C_EVT_SLAVE_GCALLADDR_MATCHED ((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_GCALLADDR))<<16) 

/**
*\*\brief  Communication events
*\*\       Wait on one of these events when EV1 has already been checked and:
*\*\       - Slave RECEIVER mode:
*\*\           - EV2: When the application is expecting a data byte to be received.
*\*\           - EV4: When the application is expecting the end of the communication: master
*\*\             sends a stop condition and data transmission is stopped.
*\*\       - Slave Transmitter mode:
*\*\          - EV3: When a byte has been transmitted by the slave and the application is expecting
*\*\            the end of the byte transmission. The two events I2C_EVT_SLAVE_DATA_SENDED and
*\*\            I2C_EVT_SLAVE_DATA_SENDING are similar. The second one can optionally be
*\*\            used when the user software doesn't guarantee the EV3 is managed before the
*\*\            current byte end of transfer.
*\*\          - EV3_2: When the master sends a NACK in order to tell slave that data transmission
*\*\            shall end (before sending the STOP condition). In this case slave has to stop sending
*\*\            data bytes and expect a Stop condition on the bus.
*\*\note In case the  user software does not guarantee that the event EV2 is
*\*\ managed before the current byte end of transfer, then user may check on EV2
*\*\ and BSF flag at the same time (ie. (I2C_EVT_SLAVE_DATA_RECVD | I2C_FLAG_BYTEF)).
*\*\In this case the communication may be slower.
 **/

/* Slave RECEIVER mode --------------------------*/
/* --EV2 */
 /* BUSY and RXDATNE flags */
#define I2C_EVT_SLAVE_DATA_RECVD (((uint32_t)I2C_STS1_RXDATNE)\
                                |((((uint32_t)I2C_STS2_BUSY))<<16))  
/* --EV2x */
 /* no BUSY and RXDATNE flags */
#define I2C_EVT_SLAVE_DATA_RECVD_NOBUSY ((uint32_t)I2C_STS1_RXDATNE)
/* --EV4  */
 /* STOPF flag */
#define I2C_EVT_SLAVE_STOP_RECVD ((uint32_t)I2C_STS1_STOPF)

/* Slave TRANSMITTER mode -----------------------*/
/* --EV3 */
 /* TRF, BUSY, TXDATE and BSF flags */
#define I2C_EVT_SLAVE_DATA_SENDED  (((uint32_t)I2C_STS1_BSF)|((uint32_t)I2C_STS1_TXDATE)\
                                  |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_TRF))<<16)) 
 /* TRF, BUSY and TXDATE flags */
#define I2C_EVT_SLAVE_DATA_SENDING (((uint32_t)I2C_STS1_TXDATE)\
                                  |((((uint32_t)I2C_STS2_BUSY)|((uint32_t)I2C_STS2_TRF))<<16)) 
/* --EV3_2 */
 /* AF flag */
#define I2C_EVT_SLAVE_ACK_MISS ((uint32_t)I2C_STS1_ACKFAIL)


void I2C_DeInit(I2C_Module* I2Cx);
void I2C_Init(I2C_Module* I2Cx, I2C_InitType* I2C_InitParam);
void I2C_InitStruct(I2C_InitType* I2C_InitParam);
void I2C_Enable(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_GenerateStart(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_GenerateStop(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_ConfigAck(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_SendAddr7bit(I2C_Module* I2Cx, uint8_t address, uint8_t mode);
void I2C_ConfigOwnAddr2(I2C_Module* I2Cx, uint8_t address);
void I2C_EnableDualAddr(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_EnableGeneralCall(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_ConfigInt(I2C_Module* I2Cx, uint32_t I2C_IT, FunctionalState Cmd);
void I2C_SendData(I2C_Module* I2Cx, uint8_t data);
uint8_t I2C_RecvData(I2C_Module* I2Cx);
void I2C_EnableDMA(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_EnableDmaLastSend(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_EnableSoftwareReset(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_ConfigNackLocation(I2C_Module* I2Cx, uint32_t position);
void I2C_ConfigPecLocation(I2C_Module* I2Cx, uint32_t position);
void I2C_ConfigSmbusAlert(I2C_Module* I2Cx, uint32_t polarity);
void I2C_SendPEC(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_ComputePec(I2C_Module* I2Cx, FunctionalState Cmd);
uint8_t I2C_GetPec(I2C_Module* I2Cx);
void I2C_EnableArp(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_EnableExtendClk(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_SetSDADigitalFilterWidth(I2C_Module* I2Cx, uint8_t width);
void I2C_SetSCLDigitalFilterWidth(I2C_Module* I2Cx, uint8_t width);
void I2C_SetSDAAnalogFilterWidth(I2C_Module* I2Cx, uint16_t width);
void I2C_EnableSDAAnalogFilter(I2C_Module* I2Cx, FunctionalState Cmd);
void I2C_SetSCLAnalogFilterWidth(I2C_Module* I2Cx, uint16_t width);
void I2C_EnableSCLAnalogFilter(I2C_Module* I2Cx, FunctionalState Cmd);
ErrorStatus I2C_CheckEvent(I2C_Module* I2Cx, uint32_t I2C_event);
uint32_t I2C_GetLastEvent(I2C_Module* I2Cx);
FlagStatus I2C_GetFlag(I2C_Module* I2Cx, uint32_t I2C_flag);
void I2C_ClrFlag(I2C_Module* I2Cx, uint32_t I2C_flag);
INTStatus I2C_GetIntStatus(I2C_Module* I2Cx, uint32_t Interrupt);
void I2C_ClrIntPendingBit(I2C_Module* I2Cx, uint32_t Interrupt);
void I2C_SetTimeoutLowLimit(I2C_Module* I2Cx, uint32_t limit);
void I2C_SetTimeoutHighLimit(I2C_Module* I2Cx, uint32_t limit);
void I2C_ConfigTimeoutInt(I2C_Module* I2Cx, uint32_t I2C_IT, FunctionalState Cmd);
void I2C_EnableTimeoutDetect(I2C_Module* I2Cx, uint32_t timeout_type, FunctionalState Cmd);
FlagStatus I2C_GetTimeoutFlag(I2C_Module* I2Cx, uint32_t I2C_flag);
void I2C_ClrTimeoutFlag(I2C_Module* I2Cx, uint32_t I2C_flag);

#ifdef __cplusplus
}
#endif

#endif /*__n32g033_I2C_H */

